app/views/beers/index.html.erb

SELECT "beers".* FROM "beers"
---
	<li id="beer_<%= beer.id%>">
		<a href="olutsivu/<%=beer.name%>"><%= beer.name  %></a> (<%= beer.beer_type %>, <%= beer.alc %>), panimo: <%= beer.brewery %>, valmistusmaa: <%= beer.country %>