app/controllers/beers_controller.rb

  def create
  	Beer.create params[:beer]
---
INSERT INTO "beers" ("alc", "beer_type", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["alc", "4,7%"], ["beer_type", "Lager"], ["created_at", Thu, 07 Mar 2013 10:50:54 UTC +00:00], ["name", "Olvi"], ["updated_at", Thu, 07 Mar 2013 10:50:54 UTC +00:00]]

  def edit
  	@beer = Beer.find params[:id]
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT 1  [["id", "9"]]

  def update
  	beer = Beer.find params[:id]
  	if beer.update_attributes params[:beer]
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT 1  [["id", "10"]]
UPDATE "beers" SET "brewery" = 'Sinebrychoff', "updated_at" = '2013-04-08 17:40:23.471659' WHERE "beers"."id" = 11

  def destroy
  	Beer.destroy params[:id]
---
DELETE FROM "beers" WHERE "beers"."id" = ?  [["id", 10]]