app/controllers/static_pages_controller.rb

  def home
    @beer = Beer.all[params[:id].to_i]
---
SELECT "beers".* FROM "beers"

  def olutsivu
  	@beer = Beer.find params[:id]
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT 1  [["id", 9]]